/****************************** (C) COPYRIGHT 2016 *******************************
 *
 *  	功能：递归解决年龄问题
 *		要点：函数，流程控制
 * 		重点：递归算法的初步学习
 *
 ********************************************************************************/

 
#include <stdio.h>




/*************************************************
	Function: 		main
	Description: 	主函数
	Calls: 			scanf	printf
	Called By:		编译器
	Input: 			无
	Output: 		无
	Return: 		0
*************************************************/
int main(void)
{
	int i;
	int j;
	int rest;
	for (j = 1; rest != 1; j++)
	{
		rest = j;
		for (i = 0; i < 9; i++)
		{
			rest = rest / 2 - 1;
		}		
	}
	printf("%d\t", j - 1);
}



