/****************************** (C) COPYRIGHT 2016 *******************************
 *
 *  	功能：集邮求总数
 *		要点：函数，流程控制
 * 		重点：掌握标识符的利用，算法思想的理解
 *
 ********************************************************************************/

 
#include <stdio.h>




/*************************************************
	Function: 		main
	Description: 	主函数
	Calls: 			scanf	printf
	Called By:		编译器
	Input: 			无
	Output: 		无
	Return: 		0
*************************************************/
int main(void)
{
	int sum;
	int x;
	int flag;
	for (x = 1; x < 6; x++)
	{
		flag = 0;
		for (sum = 303; sum < 10000; sum++)
		{
			//判断满足条件时终止，并且能够执行相关操作，标记符的灵活使用
			if (sum - 303 == sum / 5 + x * sum / 7 && (sum * x) % 7 == 0 \
				&& sum % 5 == 0) 
			{
				flag = 1;
				break;
			}
		}
		if (flag)
			printf("%d\t%d\n", x, sum);
	}
}

