/****************************** (C) COPYRIGHT 2016 *******************************
 *
 *  	功能：实现将10进制转换为16进制
 *		要点：本程序主要研究输入输出语句 
 * 
 ********************************************************************************/

 
#include <stdio.h>


/*************************************************
	Function: 		main
	Description: 	主函数
	Calls: 			scanf	printf
	Called By:		编译器
	Input: 			无
	Output: 		无
	Return: 		0
*************************************************/
int main(void)
{
	int i;
	printf("input the number:\n");
	scanf("%d", &i);		//%d表示为10进制输入
	printf("%#X", i);		//#作为16进制的格式符号，%X表示为16进制输出
}

