/****************************** (C) COPYRIGHT 2016 *******************************
 *
 *  	功能：打印特殊方阵
 *		要点：矩阵,主要找寻规律！！！本题中是四个对称，一个循环同时，对四组数据操作即可
 *		
 * 
 ********************************************************************************/
 
#include <stdio.h>
#include <stdlib.h>
#include <math.h>






/*************************************************
	Function: 		main
	Description: 	主函数
	Calls: 			scanf	printf
	Called By:		编译器
	Input: 			无
	Output: 		无
	Return: 		0
*************************************************/
int main(void)
{
	int a[10][10];
	int i, j;
	
	for (i = 1; i <= 5; i++)
	{
		for (j = i; j <= 10-i; j++) // 可以一直取到10-i的位置
		{
			a[i][j] = i;	//只产生一个三角区域
			a[j][i] = i;	//基于主对角线对称，而使用的赋值方法
			a[10-i][10-j] = i;	//对角区域赋值
			a[10-j][10-i] = i;	//对角区域赋值
		}
	}
	
	for (i = 1; i <=9; i++)
	{
		for (j = 1; j <= 9; j++)
		{
			printf("%d\t", a[i][j]);
		}
		printf("\n");
	}
}


