/****************************** (C) COPYRIGHT 2016 *******************************
 *
 *  	功能：计算xyz + yzz = 532中的x，y，z的值,xyz和yzz表示一个三位数。
 *		要点：掌握for的灵活运用,多个嵌套使用，程序思路和算法
 * 		重点：程序的优点在于计算块，可以不断反复算满足的值
 *
 ********************************************************************************/

 
#include <stdio.h>



/*************************************************
	Function: 		main
	Description: 	主函数
	Calls: 			scanf	printf
	Called By:		编译器
	Input: 			无
	Output: 		无
	Return: 		0
*************************************************/
int main(void)
{
	int x, y, z;
	for (x = 0; x < 9; x++)
	{
		for (y = 0; y < 9; y++)
		{
			for (z = 0; z < 9; z++)
			{
				if (x * 100 + y * 10 + z + y * 100 + z * 11 == 532)
					printf("x = %d, y = %d, z = %d\n", x, y, z);
			}
		}
	}
}